["Email ID: demo01 Subject: Thank you for your application to Sika Sender: no-reply@sika.com Body: Hello Nora,\n\nThank you for applying to Sika’s Materials Engineer position. After careful consideration, we have decided to move forward with other candidates whose experience more closely matches our needs at this time.\n\nWe appreciate your interest and wish you all the best in your job search.\n\nRegards,\nSika Recruiting Team",
  "Email ID: demo02 Subject: Thank you for your application to Ericsson Sender: talent@ericsson.com Body: Dear Nora,\n\nWe appreciate the time you invested in applying for the Radio SW Developer Co-op at Ericsson. Unfortunately, we will not be proceeding with your candidacy further. We encourage you to apply to other roles that match your background in the future.\n\nSincerely,\nEricsson Talent Acquisition",
  "Email ID: demo03 Subject: Thank you for your interest in WebFX Sender: hr@webfx.com Body: Hi Nora,\n\nThanks for your application to WebFX for the Digital Marketing Intern role. We had an overwhelming response and have chosen to move forward with other candidates. Please feel free to check back on our careers page for future openings.\n\nBest,\nThe WebFX Team",
  "Email ID: demo04 Subject: Thank you for applying to Hootsuite Sender: careers@hootsuite.com Body: Hello Nora,\n\nThank you for your application to Hootsuite’s Software Developer Co-Op. After reviewing all applicants, we’ve decided to proceed with other candidates. We appreciate your interest and encourage you to apply again when new roles open.\n\nWarmly,\nHootsuite Recruiting",

  "Email ID: demo05 Subject: Interview invitation with Dayforce Sender: recruiter@dayforce.com Body: Hello Nora,\n\nWe’d like to invite you to interview for the Dayforce Product Specialist position. Please let us know your availability next week for a 45-minute phone screen.\n\nLooking forward,\nDayforce Hiring Team",
  "Email ID: demo06 Subject: Your Intuit interview is scheduled Sender: talent@intuit.com Body: Hi Nora,\n\nCongratulations! Your interview for the Software Developer Co-op at Intuit has been scheduled for August 12th at 2:00 PM EST. We look forward to speaking with you.\n\nBest regards,\nIntuit Campus Recruiting",

  "Email ID: demo07 Subject: Thank you for your application to Amazon Sender: no-reply@amazon.jobs Body: Hi Nora,\n\nThank you for applying to Amazon’s Operations Manager Intern program. We’ve received your application and will review it shortly. If your qualifications match our needs, we’ll be in touch.\n\nSincerely,\nAmazon Recruiting",
  "Email ID: demo08 Subject: Thank you for your application to McKesson Sender: careers@mckesson.com Body: Dear Nora,\n\nWe wanted to let you know we have received your application for the Software & Database Development Intern role at McKesson. Our team will review your submission and contact you if there’s a match.\n\nThank you,\nMcKesson Talent Acquisition",
  "Email ID: demo09 Subject: Thank you for your application to Interac Sender: no-reply@interac.ca Body: Hello Nora,\n\nYour application for the Software Development Intern at Interac has been received. We appreciate your interest and will reach out if you’re selected for the next steps.\n\nRegards,\nInterac Recruitment",
  "Email ID: demo10 Subject: Thank you for your application to Arctic Wolf Sender: jobs@arcticwolf.com Body: Hi Nora,\n\nThanks for applying to the Arctic Wolf Software Developer Co-op. Your application has been successfully submitted; our team will review it and follow up if there’s a fit.\n\nCheers,\nArctic Wolf Talent Team",
  "Email ID: demo11 Subject: Thank you for your application to Solink Sender: talent@solink.com Body: Dear Nora,\n\nWe’ve received your application for the QA Engineering Role at Solink. Our recruitment team will review and contact you if you advance.\n\nBest,\nSolink HR",
  "Email ID: 190375a33217a658 Subject: Thank you for your application to Magnet Forensics Sender: no-reply@magnetforensics.com Body: Hello Nora,\n\nYour application for the Forensic Software Intern position at Magnet Forensics has been received and is under review. We’ll update you once we’ve had a chance to evaluate your qualifications.\n\nKind regards,\nMagnet Forensics Recruiting",
  "Email ID: 190365324c529178 Subject: Thank you for your application to Corpay Sender: recruitment@corpay.com Body: Hi Nora,\n\nThank you for applying to Corpay’s Finance Systems Intern role. We have your application and will contact you if you’re shortlisted.\n\nSincerely,\nCorpay Talent Acquisition",
  "Email ID: 190297be30ed0aa1 Subject: Thank you for your application to Tenstorrent Sender: careers@tenstorrent.com Body: Dear Nora,\n\nWe appreciate your interest in Tenstorrent’s Hardware Engineering Co-op. Your application has been received; our team will be in touch about next steps.\n\nThank you,\nTenstorrent Recruiting"]

